# Telecom Analytics with SQL

The objective of this mini-project is to get insights from a telecom database by means of querying and answer questions like:

- What is the longest (or shortest) average dwelling time (by customer)?
- What is data usage by service?
- How much is the data load by network cell? 
- Which are the the peak hours in terms of data consumption?
- What is the gender distribution by service? 

For this task we will use some Python packages namely: SQLAlchemy (database manipulation), MySQL Connector (environments connector), and ipython-sql (magic commands).

In [1]:
# Import packages 
import sqlalchemy

In [54]:
# Create a sqlalchemy engine and connect it to the mysqlconnector
engine = sqlalchemy.create_engine('mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox',echo=True)

In [ ]:
# Load the SQL module 
%load_ext sql

In [93]:
# Connect to the engine
%sql mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox

In [94]:
%%sql
SHOW databases

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
5 rows affected.

[('dbname',),
 ('information_schema',),
 ('organization',),
 ('rodrigo_sandbox',),
 ('telecommunication',)]

   As we can see, there is already a database named _telecommunication_ from where the data is stored. Let's check its content.

In [70]:
%%sql
SHOW tables from telecommunication

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
13 rows affected.

[('answer_q10',),
 ('answer_q11',),
 ('answer_q5',),
 ('answer_q6',),
 ('answer_q7',),
 ('answer_q8',),
 ('answer_q9',),
 ('cell',),
 ('cell_duration',),
 ('cell_duration_greater_than_5min',),
 ('demographic',),
 ('event',),
 ('service_duration',)]

There are 3 tables we are interested in:

- Event: table for data usage of 100 customers of a telco provider for 1 sample day of their Facebook, Instagram, YouTube, Netflix and WhatsApp.
- Cell: table of cell ids that customers were at with their latitude and longitude.
- Demographic: is a table of subscribers with their demographics such as gender.

Let's copy them to our _Sandbox_.

In [36]:
%%sql
CREATE TABLE rodrigo_sandbox.event 
AS SELECT * FROM telecommunication.event

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
10000 rows affected.

[]

In [37]:
%%sql
CREATE TABLE rodrigo_sandbox.demographic
AS SELECT * FROM telecommunication.demographic

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
100 rows affected.

[]

In [38]:
%%sql
CREATE TABLE rodrigo_sandbox.cell
AS SELECT * FROM telecommunication.cell

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
3 rows affected.

[]

## Understanding the data 

Now let's check these tables.

In [47]:
%%sql
DESCRIBE rodrigo_sandbox.event

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
8 rows affected.

[('time_hour', b'int', 'YES', '', None, ''),
 ('subscriber_id', b'varchar(300)', 'YES', '', None, ''),
 ('datetime', b'varchar(1024)', 'YES', '', None, ''),
 ('bytesdown', b'bigint', 'YES', '', None, ''),
 ('bytesup', b'bigint', 'YES', '', None, ''),
 ('service', b'varchar(100)', 'YES', '', None, ''),
 ('aircomcellid', b'char(1)', 'YES', '', None, ''),
 ('time_day', b'char(10)', 'YES', '', None, '')]

In [48]:
%%sql
SELECT COUNT(*) FROM rodrigo_sandbox.event

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[(10000,)]

From the previous queries we see that there are 10000 entries in the table _event_ with fields related with _time of the day_, _date_, _subscriber_, _service_, etc.

In [49]:
%%sql
DESCRIBE rodrigo_sandbox.demographic

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
3 rows affected.

[('subscriber_id', b'varchar(1024)', 'YES', '', None, ''),
 ('gender', b'varchar(1024)', 'YES', '', None, ''),
 ('age', b'varchar(1024)', 'YES', '', None, '')]

In [50]:
%%sql
SELECT COUNT(*) FROM rodrigo_sandbox.demographic

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[(100,)]

In contrast, the _demographic_ table has only 100 entries and the fields: _subscriber_id_, _gender_, and _age_. Finally, let's check the _cell_ table.

In [51]:
%%sql
DESCRIBE rodrigo_sandbox.cell

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
3 rows affected.

[('aircomcellid', b'varchar(1024)', 'YES', '', None, ''),
 ('lon', b'varchar(1024)', 'YES', '', None, ''),
 ('lat', b'varchar(1024)', 'YES', '', None, '')]

In [52]:
%%sql
SELECT COUNT(*) FROM rodrigo_sandbox.cell

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[(3,)]

As we can check, the _cell_ table has only 3 entries (number of netwrok cells) with theirs respective id's, longitude, and latitude info.

## Data analysis

Let's start by coverting the _datetime_ column into readable timestep and create a table with 4 new columns:

- one with the previous timestep;
- one with the next timestep;
- one with with the previous network cell;
- one with duration time in seconds for each entry (or timestamp).

In [90]:
%%sql
CREATE TABLE IF NOT EXISTS rodrigo_sandbox.table1 AS
SELECT 
    subscriber_id,
    FROM_UNIXTIME(datetime) ts, -- covert the datetime column into readable timestep
    lag(FROM_UNIXTIME(datetime)) over(PARTITION by subscriber_id ORDER BY datetime) AS prev_ts, -- create a new column with the previous timestep
    lead(FROM_UNIXTIME(datetime)) over(PARTITION by subscriber_id ORDER BY datetime) AS next_ts, -- create a new column with the next timestep
    e.service,
    aircomcellid,
    lag(aircomcellid) over(partition by subscriber_id order by datetime) prev_cell,  -- create a new column with the previous cell
    TIMESTAMPDIFF(SECOND, FROM_UNIXTIME(datetime),lead(FROM_UNIXTIME(datetime)) over(PARTITION by subscriber_id ORDER BY datetime)) as dur -- create a new column with duration at each timestep
FROM event e
ORDER BY subscriber_id,ts;

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
10000 rows affected.

[]

Now we check the result by printing the first 5 entries.

In [91]:
%%sql
SELECT * FROM rodrigo_sandbox.table1 LIMIT 0,5

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
5 rows affected.

[('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 43), None, datetime.datetime(2013, 9, 15, 22, 48, 58), 'YouTube', 'B', None, 358),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 22, 43), datetime.datetime(2013, 9, 15, 23, 24, 9), 'Facebook', 'A', 'B', 2111),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 24, 9), datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 23, 31, 3), 'YouTube', 'B', 'A', 414),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 31, 3), datetime.datetime(2013, 9, 15, 23, 24, 9), datetime.datetime(2013, 9, 15, 23, 33, 30), 'WhatsApp', 'B', 'B', 147),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 33, 30), datetime.datetime(2013, 9, 15, 23, 31, 3), datetime.datetime(2013, 9, 15, 23, 46, 33), 'Facebook', 'B', 'B', 783)]

In the sequence, we create a another table from the previous one with a new column, i.e., _position_ (an integer value) to indicate the permanence in the same network cell throughout more than one timestamp.

In [96]:
%%sql
set @CumulativeSum := 0;
CREATE TABLE IF NOT EXISTS rodrigo_sandbox.table2 AS
SELECT 
    t1.*,
    SUM(CASE WHEN t1.prev_cell != t1.aircomcellid THEN @CumulativeSum :=  1 ELSE @CumulativeSum :=  0 END) over(PARTITION by t1.subscriber_id order by t1.ts) as pos -- display a new column with the position at each timestep
FROM table1 t1;

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
0 rows affected.
10000 rows affected.

[]

Below we print the first 7 entries of the new table to check the result.

In [97]:
%%sql
SELECT * FROM rodrigo_sandbox.table2 LIMIT 0,7

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
7 rows affected.

[('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 43), None, datetime.datetime(2013, 9, 15, 22, 48, 58), 'YouTube', 'B', None, 358, Decimal('0')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 22, 43), datetime.datetime(2013, 9, 15, 23, 24, 9), 'Facebook', 'A', 'B', 2111, Decimal('1')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 24, 9), datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 23, 31, 3), 'YouTube', 'B', 'A', 414, Decimal('2')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 31, 3), datetime.datetime(2013, 9, 15, 23, 24, 9), datetime.datetime(2013, 9, 15, 23, 33, 30), 'WhatsApp', 'B', 'B', 147, Decimal('2')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 33, 30), datetime.datetime(2013, 9, 15, 23, 31, 3), datetime.datetime(2013, 9, 15, 23, 46, 33), 'Facebook', 'B', 'B', 783, Decimal('2')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 46, 33), datetime.datetime(2013, 9, 15, 23, 33, 30), datetime.datetime(2013, 9, 15, 23, 48, 36), 'Instagram', 'B', 'B', 123, Decimal('2')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 48, 36), datetime.datetime(2013, 9, 15, 23, 46, 33), datetime.datetime(2013, 9, 16, 0, 0, 57), 'Instagram', 'C', 'B', 741, Decimal('3'))]

To advance, we create a new table by querying the last one to compute the total duration time throughout the entries.

In [87]:
%%sql
CREATE TABLE IF NOT EXISTS rodrigo_sandbox.table3 AS
SELECT 
    t2.*,
    min(UNIX_TIMESTAMP(ts)) AS start_time,
    max(UNIX_TIMESTAMP(next_ts)) AS end_time,
    (max(UNIX_TIMESTAMP(next_ts)) - min(UNIX_TIMESTAMP(ts))) as tot_dur
FROM table2 t2
GROUP BY subscriber_id,aircomcellid,pos

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
6252 rows affected.

[]

Again, let's check the result.

In [104]:
%%sql
SELECT * FROM rodrigo_sandbox.table3 LIMIT 0,4

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
4 rows affected.

[('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 43), None, datetime.datetime(2013, 9, 15, 22, 48, 58), 'YouTube', 'B', None, 5, Decimal('0'), Decimal('1379284980.000000'), Decimal('1379285338.000000'), Decimal('358.000000')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 22, 43), datetime.datetime(2013, 9, 15, 23, 24, 9), 'Facebook', 'A', 'B', 35, Decimal('1'), Decimal('1379285338.000000'), Decimal('1379287449.000000'), Decimal('2111.000000')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 24, 9), datetime.datetime(2013, 9, 15, 22, 48, 58), datetime.datetime(2013, 9, 15, 23, 31, 3), 'YouTube', 'B', 'A', 6, Decimal('2'), Decimal('1379287449.000000'), Decimal('1379288916.000000'), Decimal('1467.000000')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', datetime.datetime(2013, 9, 15, 23, 48, 36), datetime.datetime(2013, 9, 15, 23, 46, 33), datetime.datetime(2013, 9, 16, 0, 0, 57), 'Instagram', 'C', 'B', 12, Decimal('3'), Decimal('1379288916.000000'), Decimal('1379289657.000000'), Decimal('741.000000'))]

Now we are able to create a table with average duration of stay (dwelling time in minutes) of each customer at each network cell, but only for customers who stayed at least 5 minutes.

In [98]:
%%sql

CREATE TABLE IF NOT EXISTS rodrigo_sandbox.table4 AS
SELECT subscriber_id, aircomcellid, (AVG(tot_dur)/60) duration_minutes 
FROM table3
WHERE tot_dur >= 300 -- select dwell time above 5 min.
GROUP BY subscriber_id,aircomcellid
ORDER BY subscriber_id,ts;

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
0 rows affected.

[]

Let's check the result and print such information for the first 2 customers.

In [101]:
%%sql
SELECT * FROM rodrigo_sandbox.table4 LIMIT 0,6

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
6 rows affected.

[('02e74f10e0327ad868d138f2b4fdd6f0', 'B', Decimal('27.66474359')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', 'A', Decimal('20.48939394')),
 ('02e74f10e0327ad868d138f2b4fdd6f0', 'C', Decimal('25.14705882')),
 ('03afdbd66e7929b125f8597834fa83a4', 'C', Decimal('25.23437500')),
 ('03afdbd66e7929b125f8597834fa83a4', 'B', Decimal('35.15476190')),
 ('03afdbd66e7929b125f8597834fa83a4', 'A', Decimal('15.07222222'))]

Another interesting output would be a table with an histogram of how many subscribers stayed on average at each network cell more than 5 minutes on intervals of 100 minutes. Let's build that.

In [102]:
%%sql
SELECT FLOOR((tot_dur/60)/100)*100 as 'interval',
    count(tot_dur) as cnt_sub
FROM table3 t3
WHERE (tot_dur/60) >= 5 -- select dwelling time above 5 min.
GROUP BY 1
ORDER BY 1;

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
3 rows affected.

[(0, 4822), (100, 84), (200, 3)]

Let's check which customer has longest average dwelling time (not considering stays at cells that were less than 5 minutes) and which customer has shortest.

In [136]:
%%sql
SELECT subscriber_id ,
    MAX(duration_minutes)  
FROM table4
GROUP BY subscriber_id
ORDER BY MAX(duration_minutes) DESC
LIMIT 0,1

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('70efdf2ec9b086079795c442636b55fb', Decimal('54.13181818'))]

In [141]:
%%sql
SELECT subscriber_id ,
    MIN(duration_minutes)
FROM table4
GROUP BY subscriber_id
ORDER BY MIN(duration_minutes)
LIMIT 0,1

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('e2c420d928d4bf8ce0ff2ec19b371514', Decimal('13.29487179'))]

From the query below we can find what is the total bytesdown and bytesup usage of Netflix between 8:00 to 10:00 pm.

In [143]:
%%sql
SELECT service,
    bytesdown,
    bytesup
FROM event e
WHERE time_hour >= 20 AND time_hour <=22
GROUP BY service
LIMIT 0,1

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('Netflix', 191340, 5702)]

Let's compare it with Netflix usage between 8:00 and 10:00 am.

In [145]:
%%sql
SELECT service,
    bytesdown,
    bytesup
FROM event e
WHERE time_hour >= 8 AND time_hour <=10 
GROUP BY service
LIMIT 4,5

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('Netflix', 29987, 1645)]

Now we are interested to check which service has the highest bytesdown (on average).

In [148]:
%%sql
SELECT service,
    AVG(bytesdown),
    AVG(bytesup)
FROM event e
GROUP BY service
ORDER BY AVG(bytesdown) DESC
LIMIT 0,1

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('Instagram', Decimal('383860.2060'), Decimal('6977.8727'))]

Which network cell has highest load (bytesdown + bytesup) on Youtube? We can check that.

In [151]:
%%sql
SELECT aircomcellid ,
    service,
    MAX(bytesdown+bytesup) AS 'load'
FROM event e
WHERE service = 'YouTube'  
GROUP BY aircomcellid
ORDER BY MAX(bytesdown+bytesup) DESC
LIMIT 0,1

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
1 rows affected.

[('C', 'YouTube', 308399)]

Maybe it is a good idea to know which hour of the day has the highest data consumption on each cells. Do all
cells are on highest peak at the same hour of the day? Let's check.

In [155]:
%%sql
SELECT time_hour,
    (bytesdown+bytesup) as 'load',
    aircomcellid
FROM event e 
GROUP BY time_hour, aircomcellid   
ORDER BY (bytesdown+bytesup) DESC  
LIMIT 0,3

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
3 rows affected.

[(21, 781274, 'A'), (20, 610436, 'B'), (14, 562950, 'C')]

As we can see, cells A and B peak are in the evening while the peak of cell C is the afternoon.

Finally, let's try to answer these questions:
- What portion of males and females use Netflix? 
- What portion of males and females use Instagram? 
- Which service is mostly used by males?

In [156]:
%%sql
SELECT  
    d.gender, 
    SUM(CASE WHEN e.service = 'YouTube' THEN 1 ELSE 0 END)/2000 as 'YouTube',
    SUM(CASE WHEN e.service = 'Instagram' THEN 1 ELSE 0 END)/3000 as 'Instagram', -- 53% of users are Male / 47% of users are Female
    SUM(CASE WHEN e.service = 'Netflix' THEN 1 ELSE 0 END)/1500 as 'Netflix', -- 53% of users are Male / 47% of users are Female
    SUM(CASE WHEN e.service = 'Facebook' THEN 1 ELSE 0 END)/1500 as 'Facebook',
    SUM(CASE WHEN e.service = 'WhatsApp' THEN 1 ELSE 0 END)/2000 as 'WhatsApp'
FROM event e 
RIGHT JOIN demographic d 
ON e.subscriber_id = d.subscriber_id 
GROUP BY gender

 * mysql+mysqlconnector://rodrigo:***@database-2.cwkjamv2pld3.eu-central-1.rds.amazonaws.com:3306/rodrigo_sandbox
2 rows affected.

[('Male', Decimal('0.5300'), Decimal('0.5300'), Decimal('0.5300'), Decimal('0.5300'), Decimal('0.5300')),
 ('Female', Decimal('0.4700'), Decimal('0.4700'), Decimal('0.4700'), Decimal('0.4700'), Decimal('0.4700'))]

From the previous query, Netflix users are divided by males (53%) and females (47%). Instagram users are divided in the same proportion. By the way, all services are mostly used by males.

## Conclusion

In this task we were able to query from an structured database using SQL syntax from a Python environment. We were alble to extract quite interesting insights from data just performing queries like which customer has longest (or shortest) average dwelling time, what portion of males and females use some service, and so on. As we could see, data manipulation is a strong tool to get very interesting info from data.